Table of Contents
 Class ApplyConnTemplateSetting
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Defaults which are used for applying template
[DataContract]
public class ApplyConnTemplateSetting
Inheritance
object
ApplyConnTemplateSetting
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 DefaultBoltAssemblyID
ID of the bolt assembly which will be used as default (it must exists in the project)
[DataMember]
public int DefaultBoltAssemblyID { get; set; }
Property Value
int
 DefaultCleatCrossSectionID
ID of the cross section for cleats which will be used as default (it must exists in the project)
[DataMember]
public int DefaultCleatCrossSectionID { get; set; }
Property Value
int
 DefaultConcreteMaterialID
ID of the material concrete which will be used as default (it must exists in the project)
[DataMember]
public int DefaultConcreteMaterialID { get; set; }
Property Value
int
 DefaultStiffMemberCrossSectionID
ID of the cross-section for stiffening members concrete which will be used as default (it must exists in the project)
[DataMember]
public int DefaultStiffMemberCrossSectionID { get; set; }
Property Value
int
 UseMatFromOrigin
Get or set whether to use materials from original connection model (and these materials must exist in the project)
[DataMember]
public bool UseMatFromOrigin { get; set; }
Property Value
bool
 Edit this page